#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # helm_release.bifrost will be created
  + resource "helm_release" "bifrost" {
      + atomic                     = true
      + chart                      = "bifrost"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "bifrost"
      + namespace                  = "bifrost"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://maximhq.github.io/bifrost/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = [
          + (sensitive value),
          + <<-EOT
                autoscaling:
                  enabled: true
                  minReplicas: 1
                  maxReplicas: 2
                  targetCPUUtilizationPercentage: 80
                  targetMemoryUtilizationPercentage: 80
                bifrost:
                  framework:
                    pricing:
                      pricingUrl: 'http://control.control/bifrost/pricingSheet'
                      pricingSyncInterval: 3600
                  logLevel: info
                
                  client:
                    prometheusLabels: ["team", "environment", "organization", "project"]
                    dropExcessRequests: true
                    enableLogging: true
                    enableGovernance: true
                    enforceGovernanceHeader: true
                    allowDirectKeys: true
                    disableContentLogging: true
                    logRetentionDays: 365
                
                  providers:
                    kubeai:
                      keys:
                        - value: "-"
                          weight: 1
                          name: "nokey"
                      network_config:
                        base_url: http://kubeai.kubeai/openai
                        default_request_timeout_in_seconds: 60
                      custom_provider_config:
                        base_provider_type: openai
                        is_key_less: true
                
                        allowed_requests:
                          list_models: true
                          text_completion: true
                          text_completion_stream: true
                          chat_completion: true
                          chat_completion_stream: true
                          responses: true
                          responses_stream: true
                          count_tokens: true
                          embedding: true
                          speech: false
                          speech_stream: false
                          transcription: false
                          transcription_stream: false
                          batch_create: false
                          batch_list: false
                          batch_retrieve: false
                          batch_cancel: false
                          batch_results: false
                          file_upload: false
                          file_list: false
                          file_retrieve: false
                          file_delete: false
                          file_content: false
                
                  plugins:
                    telemetry:
                      enabled: true
                    logging:
                      enabled: true
                    governance:
                      enabled: true
                      config:
                        is_vk_mandatory: true
                    otel:
                      enabled: true
                      config:
                        service_name: "bifrost"
                        collector_url: "http://tempo.monitoring.svc.cluster.local:4318/v1/traces"
                        trace_type: "otel"
                        protocol: "http"
                image:
                  tag: 'v1.4.6'
                replicaCount: 5
                storage:
                  mode: postgres
                resources:
                  requests:
                    cpu: 100m
                    memory: 128Mi
                  limits:
                    cpu: 2000m
                    memory: 2Gi
                postgresql:
                  enabled: true
                  metrics:
                    enabled: true
                  primary:
                    persistence:
                      size: 50Gi
                    resources:
                      requests:
                        cpu: 100m
                        memory: 128Mi
                      limits:
                        cpu: 2000m
                        memory: 2Gi
                ingress:
                  enabled: true
                  className: nginx
                  annotations:
                    cert-manager.io/cluster-issuer: letsencrypt
                    nginx.ingress.kubernetes.io/auth-url: "http://oauth2-proxy.oauth2-proxy.svc.cluster.local/oauth2/auth"
                    nginx.ingress.kubernetes.io/auth-signin: "https://oauth2-proxy.pr.inferencebros.com/oauth2/start?rd=$scheme://$host$request_uri"
                    nginx.ingress.kubernetes.io/proxy-buffering: "off"
                    nginx.ingress.kubernetes.io/proxy-read-timeout: "3600"
                    nginx.ingress.kubernetes.io/proxy-send-timeout: "3600"
                    nginx.ingress.kubernetes.io/proxy-body-size: "128m"
                    nginx.ingress.kubernetes.io/proxy-connect-timeout: "3600"
                    nginx.ingress.kubernetes.io/ssl-redirect: 'true'
                  hosts:
                    - host: bifrost.pr.inferencebros.com
                      paths:
                        - path: /
                          pathType: Prefix
                  tls:
                    - secretName: bifrost-tls
                      hosts:
                        - bifrost.pr.inferencebros.com
            EOT,
        ]
      + verify                     = false
      + version                    = "2.0.4"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.bifrost_openai_ingress will be created
  + resource "helm_release" "bifrost_openai_ingress" {
      + atomic                     = true
      + chart                      = "resource"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "bifrost-openai-ingress"
      + namespace                  = "bifrost"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://dasmeta.github.io/helm/"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = [
          + <<-EOT
                resource:
                  apiVersion: networking.k8s.io/v1
                  kind: Ingress
                  metadata:
                    name: bifrost-public-v1
                    namespace: bifrost
                    labels:
                      app.kubernetes.io/instance: bifrost
                      app.kubernetes.io/name: bifrost
                    annotations:
                      cert-manager.io/cluster-issuer: letsencrypt
                      nginx.ingress.kubernetes.io/proxy-buffering: "off"
                      nginx.ingress.kubernetes.io/proxy-read-timeout: "3600"
                      nginx.ingress.kubernetes.io/proxy-send-timeout: "3600"
                      nginx.ingress.kubernetes.io/proxy-body-size: "128m"
                      nginx.ingress.kubernetes.io/proxy-connect-timeout: "3600"
                      nginx.ingress.kubernetes.io/ssl-redirect: 'true'
                  spec:
                    ingressClassName: nginx
                
                    tls:
                      - hosts:
                          - bifrost.pr.inferencebros.com
                        secretName: bifrost-tls
                
                    rules:
                      - host: bifrost.pr.inferencebros.com
                        http:
                          paths:
                            - path: /v1
                              pathType: Prefix
                              backend:
                                service:
                                  name: bifrost
                                  port:
                                    number: 8080
                            - path: /openai
                              pathType: Prefix
                              backend:
                                service:
                                  name: bifrost
                                  port:
                                    number: 8080
                            - path: /anthropic
                              pathType: Prefix
                              backend:
                                service:
                                  name: bifrost
                                  port:
                                    number: 8080
                            - path: /langchain
                              pathType: Prefix
                              backend:
                                service:
                                  name: bifrost
                                  port:
                                    number: 8080
                            - path: /litellm
                              pathType: Prefix
                              backend:
                                service:
                                  name: bifrost
                                  port:
                                    number: 8080
                            - path: /genai
                              pathType: Prefix
                              backend:
                                service:
                                  name: bifrost
                                  port:
                                    number: 8080
            EOT,
        ]
      + verify                     = false
      + version                    = "0.1.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.bifrost_service_monitor will be created
  + resource "helm_release" "bifrost_service_monitor" {
      + atomic                     = true
      + chart                      = "resource"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "bifrost-service-monitor"
      + namespace                  = "bifrost"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://dasmeta.github.io/helm/"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = [
          + <<-EOT
                resource:
                  apiVersion: monitoring.coreos.com/v1
                  kind: ServiceMonitor
                  metadata:
                    name: bifrost
                    namespace: bifrost
                  spec:
                    endpoints:
                    - interval: 30s
                      port: http
                      path: /metrics
                    namespaceSelector:
                      matchNames:
                      - bifrost
                    selector:
                      matchLabels:
                        app.kubernetes.io/instance: bifrost
                        app.kubernetes.io/name: bifrost
            EOT,
        ]
      + verify                     = false
      + version                    = "0.1.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.cert_manager will be created
  + resource "helm_release" "cert_manager" {
      + atomic                     = true
      + chart                      = "cert-manager"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cert-manager"
      + namespace                  = "cert-manager"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.jetstack.io"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = [
          + <<-EOT
                crds:
                  enabled: true
                prometheus:
                  servicemonitor:
                    enabled: true
                resources:
                  requests:
                    cpu: 50m
                    memory: 50Mi
                  limits:
                    cpu: 150m
                    memory: 100Mi
                webhook:
                  resources:
                    requests:
                      cpu: 50m
                      memory: 32Mi
                    limits:
                      cpu: 150m
                      memory: 50Mi
                cainjector:
                  resources:
                    requests:
                      cpu: 50m
                      memory: 60Mi
                    limits:
                      cpu: 150m
                      memory: 100Mi
            EOT,
        ]
      + verify                     = false
      + version                    = "1.19.2"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.cert_manager_issuer will be created
  + resource "helm_release" "cert_manager_issuer" {
      + atomic                     = true
      + chart                      = "cert-manager-letsencrypt"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cert-manager-issuer"
      + namespace                  = "cert-manager"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://radar-base.github.io/radar-helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = [
          + (sensitive value),
        ]
      + verify                     = false
      + version                    = "0.2.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.cert_manager_self_signed_issuer will be created
  + resource "helm_release" "cert_manager_self_signed_issuer" {
      + atomic                     = true
      + chart                      = "resource"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cert-manager-self-signed-issuer"
      + namespace                  = "cert-manager"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://dasmeta.github.io/helm/"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = [
          + <<-EOT
                resource:
                  apiVersion: cert-manager.io/v1
                  kind: ClusterIssuer
                  metadata:
                    name: root-ca-issuer
                  spec:
                    ca:
                      secretName: root-ca
            EOT,
        ]
      + verify                     = false
      + version                    = "0.1.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.cluster_admins["someone"] will be created
  + resource "helm_release" "cluster_admins" {
      + atomic                     = true
      + chart                      = "clusterrolebinding"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cluster-admin-someone"
      + namespace                  = "default"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://ameijer.github.io/k8s-as-helm/"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = [
          + <<-EOT
                roleRef:
                  apiGroup: rbac.authorization.k8s.io
                  name: cluster-admin
                  kind: ClusterRole
                      
                subjects:
                  - kind: User
                    name: someone@inferencebros.com
                    apiGroup: rbac.authorization.k8s.io
            EOT,
        ]
      + verify                     = false
      + version                    = "1.0.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.control_public_ingress will be created
  + resource "helm_release" "control_public_ingress" {
      + atomic                     = true
      + chart                      = "resource"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "control-public-ingress"
      + namespace                  = "control"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://dasmeta.github.io/helm/"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = [
          + <<-EOT
                resource:
                  apiVersion: networking.k8s.io/v1
                  kind: Ingress
                  metadata:
                    name: control-public
                    namespace: control
                    labels:
                      app.kubernetes.io/instance: control
                      app.kubernetes.io/name: control
                    annotations:
                      cert-manager.io/cluster-issuer: letsencrypt
                      nginx.ingress.kubernetes.io/ssl-redirect: 'true'
                  spec:
                    ingressClassName: nginx
                
                    tls:
                      - hosts:
                          - control.pr.inferencebros.com
                        secretName: control-tls
                
                    rules:
                      - host: control.pr.inferencebros.com
                        http:
                          paths:
                            - path: /usage
                              pathType: Prefix
                              backend:
                                service:
                                  name: control
                                  port:
                                    number: 80
            EOT,
        ]
      + verify                     = false
      + version                    = "0.1.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.coredns_custom_config will be created
  + resource "helm_release" "coredns_custom_config" {
      + atomic                     = true
      + chart                      = "resource"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "coredns-custom-config"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://dasmeta.github.io/helm/"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = [
          + <<-EOT
                resource:
                  apiVersion: v1
                  kind: ConfigMap
                  metadata:
                    name: coredns-custom
                    namespace: kube-system
                  data:
                    pr.inferencebros.com.override: |
                      template IN A pr.inferencebros.com {
                          match (.*)\.pr\.inferencebros\.com
                          answer "{{.Name}} 60 IN A 192.168.0.240"
                      }
            EOT,
        ]
      + verify                     = false
      + version                    = "0.1.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.dex will be created
  + resource "helm_release" "dex" {
      + atomic                     = true
      + chart                      = "dex"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "dex"
      + namespace                  = "dex"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.dexidp.io"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = [
          + (sensitive value),
          + (sensitive value),
        ]
      + verify                     = false
      + version                    = "0.24.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.fluent-bit[0] will be created
  + resource "helm_release" "fluent-bit" {
      + atomic                     = true
      + chart                      = "fluent-bit"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "fluent-bit"
      + namespace                  = "monitoring"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://fluent.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = [
          + <<-EOT
                resources:
                  limits:
                    cpu: 300m
                    memory: 256Mi
                  requests:
                    cpu: 50m
                    memory: 128Mi
                
                config:
                  outputs: |
                    [OUTPUT]
                        Name                   loki
                        Match                  *
                        Host                   loki
                        Port                   3100
                        Labels                 job=fluentbit
                        Auto_Kubernetes_Labels on
            EOT,
        ]
      + verify                     = false
      + version                    = "0.55.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.goldilocks[0] will be created
  + resource "helm_release" "goldilocks" {
      + atomic                     = true
      + chart                      = "goldilocks"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "goldilocks"
      + namespace                  = "goldilocks"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.fairwinds.com/stable"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = [
          + <<-EOT
                vpa:
                  enabled: true
                  admissionController:
                    resources:
                      limits:
                        cpu: 150m
                        memory: 90Mi
                      requests:
                        cpu: 50m
                        memory: 30Mi
                  updater:
                    enabled: false
                    resources:
                      limits:
                        cpu: 150m
                        memory: 90Mi
                      requests:
                        cpu: 50m
                        memory: 30Mi
                  recommender:
                    extraArgs:
                      prometheus-address: |
                        http://prometheus-operated.monitoring.svc.cluster.local:9090
                      storage: prometheus
                    resources:
                      limits:
                        cpu: 150m
                        memory: 90Mi
                      requests:
                        cpu: 50m
                        memory: 30Mi
                image:
                  pullPolicy: IfNotPresent
                controller:
                  flags:
                    on-by-default: true
                  resources:
                    requests:
                      cpu: 100m
                      memory: 50Mi
                    limits:
                      cpu: 150m
                      memory: 100Mi
                dashboard:
                  replicaCount: 1
                  resources:
                    requests:
                      cpu: 50m
                      memory: 30Mi
                    limits:
                      cpu: 150m
                      memory: 90Mi
                  ingress:
                    enabled: true
                    ingressClassName: nginx
                    annotations:
                      nginx.ingress.kubernetes.io/ssl-redirect: 'true'
                      cert-manager.io/cluster-issuer: letsencrypt
                      nginx.ingress.kubernetes.io/auth-url: "http://oauth2-proxy.oauth2-proxy.svc.cluster.local/oauth2/auth"
                      nginx.ingress.kubernetes.io/auth-signin: "https://oauth2-proxy.pr.inferencebros.com/oauth2/start?rd=$scheme://$host$request_uri"
                      nginx.ingress.kubernetes.io/proxy-buffering: "off"
                      nginx.ingress.kubernetes.io/proxy-read-timeout: "3600"
                      nginx.ingress.kubernetes.io/proxy-send-timeout: "3600"
                      nginx.ingress.kubernetes.io/proxy-connect-timeout: "3600"
                    hosts:
                      - host: goldilocks.pr.inferencebros.com
                        paths:
                          - path: /
                            type: ImplementationSpecific
                    tls:
                      - secretName: goldilocks-tls
                        hosts:
                          - goldilocks.pr.inferencebros.com
            EOT,
        ]
      + verify                     = false
      + version                    = "10.2.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.headlamp[0] will be created
  + resource "helm_release" "headlamp" {
      + atomic                     = true
      + chart                      = "headlamp"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "headlamp"
      + namespace                  = "headlamp"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes-sigs.github.io/headlamp/"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = [
          + <<-EOT
                config:
                  baseURL: ""
                  enableHelm: true
                  extraArgs:
                  
                  inCluster: true
                  oidc:
                    callbackURL: ""
                    clientID: k3s
                    clientSecret: ""
                    externalSecret:
                      enabled: false
                      name: ""
                    issuerURL: https://dex.pr.inferencebros.com
                    meUserInfoURL: ""
                    scopes: openid profile email offline_access
                    secret:
                      create: true
                      name: oidc
                    useAccessToken: false
                    usePKCE: true
                    validatorClientID: ""
                    validatorIssuerURL: ""
                  pluginsDir: /headlamp/plugins
                  watchPlugins: true
                ingress:
                  annotations:
                    cert-manager.io/cluster-issuer: letsencrypt
                    nginx.ingress.kubernetes.io/ssl-redirect: 'true'
                  enabled: true
                  hosts:
                  - host: headlamp.pr.inferencebros.com
                    paths:
                    - path: /
                      type: ImplementationSpecific
                  ingressClassName: nginx
                  labels: {}
                  tls:
                  - hosts:
                    - headlamp.pr.inferencebros.com
                    secretName: headlamp-tls
                pluginsManager:
                  baseImage: node:lts-alpine
                  configContent: |
                    plugins: []
                  configFile: plugin.yml
                  enabled: false
                  securityContext: {}
                  version: latest
                resources:
                  requests:
                    cpu: 50m
                    memory: 128Mi
                  limits:
                    cpu: 300m
                    memory: 256Mi
            EOT,
        ]
      + verify                     = false
      + version                    = "0.40.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.ingress_nginx will be created
  + resource "helm_release" "ingress_nginx" {
      + atomic                     = true
      + chart                      = "ingress-nginx"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "ingress-nginx"
      + namespace                  = "ingress-nginx"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes.github.io/ingress-nginx"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = [
          + <<-EOT
                controller:
                  ingressClassResource:
                    default: true
                  autoscaling:
                    enabled: true
                    minReplicas: 1
                    maxReplicas: 2
                    targetCPUUtilizationPercentage: 80
                    targetMemoryUtilizationPercentage: 80
                  resources:
                    requests:
                      cpu: 100m
                      memory: 128Mi
                    limits:
                      cpu: 2000m
                      memory: 2Gi
                  replicaCount: 5
                  config:
                    annotations-risk-level: Critical
                    enable-opentelemetry: "true"
                    otlp-collector-host: tempo.monitoring.svc.cluster.local
                    otlp-collector-port: "4317"
                    otel-service-name: ingress-nginx
                    opentelemetry-trust-incoming-span: "true"
                    otel-sampler: AlwaysOn
                  allowSnippetAnnotations: true
                  service:
                    loadBalancerIP: "192.168.0.240"
                    
                  metrics:
                    enabled: true
                    serviceMonitor:
                      enabled: true
            EOT,
        ]
      + verify                     = false
      + version                    = "4.14.2"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.kube_prometheus_stack[0] will be created
  + resource "helm_release" "kube_prometheus_stack" {
      + atomic                     = true
      + chart                      = "kube-prometheus-stack"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "prometheus"
      + namespace                  = "monitoring"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://prometheus-community.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = [
          + (sensitive value),
        ]
      + verify                     = false
      + version                    = "81.2.2"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.kubeai will be created
  + resource "helm_release" "kubeai" {
      + atomic                     = true
      + chart                      = "kubeai"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "kubeai"
      + namespace                  = "kubeai"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://www.kubeai.org"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = [
          + (sensitive value),
        ]
      + verify                     = false
      + version                    = "0.23.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.kubeai_hpa[0] will be created
  + resource "helm_release" "kubeai_hpa" {
      + atomic                     = true
      + chart                      = "resource"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "kubeai-hpa"
      + namespace                  = "kubeai"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://dasmeta.github.io/helm/"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = [
          + <<-EOT
                resource:
                  apiVersion: autoscaling/v2
                  kind: HorizontalPodAutoscaler
                  metadata:
                    name: kubeai
                  spec:
                    scaleTargetRef:
                      apiVersion: apps/v1
                      kind: Deployment
                      name: kubeai
                    minReplicas: 1
                    maxReplicas: 2
                    metrics:
                      - type: Resource
                        resource:
                          name: cpu
                          target:
                            type: Utilization
                            averageUtilization: 80
                      - type: Resource
                        resource:
                          name: memory
                          target:
                            type: Utilization
                            averageUtilization: 80
            EOT,
        ]
      + verify                     = false
      + version                    = "0.1.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.kubeai_models_explorer will be created
  + resource "helm_release" "kubeai_models_explorer" {
      + atomic                     = true
      + chart                      = "application"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "kubeai-models-explorer"
      + namespace                  = "kubeai"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://stakater.github.io/stakater-charts"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = [
          + <<-EOT
                # FileBrowser Quantum Helm Chart Values
                # Application Name
                applicationName: kubeai-models-explorer
                
                # Deployment Configuration
                deployment:
                  enabled: true
                  replicas: 1
                
                  # Container Image
                  image:
                    repository: gtstef/filebrowser
                    tag: stable-slim
                    pullPolicy: IfNotPresent
                
                  # Environment Variables
                  env:
                    FILEBROWSER_CONFIG:
                      value: "/home/filebrowser/config/config.yaml"
                    # TZ:
                    #   value: "America/New_York"
                
                  # Container Ports
                  ports:
                    - containerPort: 80
                      name: http
                      protocol: TCP
                
                  # Volumes
                  volumes:
                    db-data:
                      emptyDir: {}
                    config-data:
                      configMap:
                        name: kubeai-models-explorer-config
                    files:
                      persistentVolumeClaim:
                        claimName: models
                
                  # Volume Mounts
                  volumeMounts:
                    db-data:
                      mountPath: /home/filebrowser/data
                    config-data:
                      mountPath: /home/filebrowser/config
                    files:
                      mountPath: /folder
                
                  # Security Context - Run as non-root user
                  containerSecurityContext:
                    readOnlyRootFilesystem: false
                    runAsNonRoot: true
                    runAsUser: 1000
                    runAsGroup: 1000
                
                  securityContext:
                    fsGroup: 1000
                
                  # Health Probes
                  readinessProbe:
                    enabled: true
                    httpGet:
                      path: /health
                      port: http
                      scheme: HTTP
                    initialDelaySeconds: 10
                    periodSeconds: 10
                    timeoutSeconds: 5
                    successThreshold: 1
                    failureThreshold: 3
                
                  livenessProbe:
                    enabled: true
                    httpGet:
                      path: /health
                      port: http
                      scheme: HTTP
                    initialDelaySeconds: 30
                    periodSeconds: 30
                    timeoutSeconds: 5
                    successThreshold: 1
                    failureThreshold: 3
                
                  # Resource Limits
                  resources:
                    requests:
                      memory: 128Mi
                      cpu: 50m
                    limits:
                      memory: 384Mi
                      cpu: 150m
                
                
                # Service Configuration
                service:
                  enabled: true
                  type: ClusterIP
                  ports:
                    - port: 80
                      name: http
                      protocol: TCP
                      targetPort: http
                
                # Ingress Configuration (Optional - Enable if needed)
                ingress:
                  enabled: true
                  annotations:
                    nginx.ingress.kubernetes.io/ssl-redirect: 'true'
                    cert-manager.io/cluster-issuer: letsencrypt
                    nginx.ingress.kubernetes.io/auth-url: "http://oauth2-proxy.oauth2-proxy.svc.cluster.local/oauth2/auth"
                    nginx.ingress.kubernetes.io/auth-signin: "https://oauth2-proxy.pr.inferencebros.com/oauth2/start?rd=$scheme://$host$request_uri"
                    nginx.ingress.kubernetes.io/proxy-buffering: "off"
                    nginx.ingress.kubernetes.io/proxy-read-timeout: "3600"
                    nginx.ingress.kubernetes.io/proxy-send-timeout: "3600"
                    nginx.ingress.kubernetes.io/proxy-connect-timeout: "3600"
                  ingressClassName: "nginx"
                  hosts:
                    - host: models.pr.inferencebros.com
                      paths:
                        - path: /
                          pathType: Prefix
                          serviceName: kubeai-models-explorer
                          servicePort: http
                  tls:
                    - secretName: models-tls
                      hosts:
                        - models.pr.inferencebros.com
                
                persistence:
                  enabled: false
                
                configMap:
                  enabled: true
                  files:
                    config:
                      config.yaml: |
                        userDefaults:
                          showHidden: true
                          disableUpdateNotifications: true
                          fileLoading:
                            maxConcurrentUpload: 10
                            uploadChunkSizeMb: 100
                        server:
                          disableUpdateCheck: true
                          disablePreviews: true
                
                          database: /home/filebrowser/data/filebrowser.db
                          sources:
                            - path: /folder
                              config:
                                defaultEnabled: true
                        auth:
                          methods:
                            noauth: true
                        frontend:
                          disableDefaultLinks: true
                          name: "KubeAI Models Explorer"
                          externalLinks: []
                
                
                # RBAC Configuration
                rbac:
                  enabled: true
                  serviceAccount:
                    enabled: true
                    name: "filebrowser-sa"
            EOT,
        ]
      + verify                     = false
      + version                    = "6.14.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.kubeai_models_pvc will be created
  + resource "helm_release" "kubeai_models_pvc" {
      + atomic                     = false
      + chart                      = "resource"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "kubeai-models-pvc"
      + namespace                  = "kubeai"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://dasmeta.github.io/helm/"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = [
          + <<-EOT
                resource:
                  apiVersion: v1
                  kind: PersistentVolumeClaim
                  metadata:
                    name: models
                    namespace: kubeai
                  spec:
                    accessModes:
                      - ReadWriteOnce
                    resources:
                      requests:
                        storage: 100Gi
            EOT,
        ]
      + verify                     = false
      + version                    = "0.1.1"
      + wait                       = false
      + wait_for_jobs              = false
    }

  # helm_release.loki[0] will be created
  + resource "helm_release" "loki" {
      + atomic                     = true
      + chart                      = "loki"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "loki"
      + namespace                  = "monitoring"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://grafana.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = [
          + <<-EOT
                gateway:
                  enabled: false
                memcached:
                  enabled: false
                resultsCache:
                  enabled: false
                chunksCache:
                  enabled: false
                test:
                  enabled: false
                deploymentMode: SingleBinary
                lokiCanary:
                  enabled: false
                loki:
                  auth_enabled: false
                  commonConfig:
                    replication_factor: 1
                  schemaConfig:
                    configs:
                      - from: "2024-04-01"
                        store: tsdb
                        object_store: filesystem
                        schema: v13
                        index:
                          prefix: loki_index_
                          period: 24h
                  pattern_ingester:
                    enabled: true
                  storage:
                    type: filesystem
                singleBinary:
                  replicas: 1
                  persistence:
                    accessModes:
                    - ReadWriteOnce
                    enabled: true
                    size: 5Gi
                  resources:
                    requests:
                      cpu: 100m
                      memory: 256Mi
                    limits:
                      cpu: 500m
                      memory: 1Gi
                backend:
                  replicas: 0
                read:
                  replicas: 0
                write:
                  replicas: 0
                
                ingester:
                  replicas: 0
                querier:
                  replicas: 0
                queryFrontend:
                  replicas: 0
                queryScheduler:
                  replicas: 0
                distributor:
                  replicas: 0
                compactor:
                  replicas: 0
                indexGateway:
                  replicas: 0
                bloomCompactor:
                  replicas: 0
                bloomGateway:
                  replicas: 0
            EOT,
        ]
      + verify                     = false
      + version                    = "6.51.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.metallb will be created
  + resource "helm_release" "metallb" {
      + atomic                     = true
      + chart                      = "metallb"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "metallb"
      + namespace                  = "metallb-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://metallb.github.io/metallb"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = [
          + <<-EOT
                prometheus:
                  rbacPrometheus: false
                  serviceMonitor:
                    enabled: true
                controller:
                  resources:
                    requests:
                      cpu: 50m
                      memory: 30Mi
                    limits:
                      cpu: 250m
                      memory: 90Mi
                speaker:
                  resources:
                    requests:
                      cpu: 50m
                      memory: 30Mi
                    limits:
                      cpu: 250m
                      memory: 90Mi
                  frr:
                    enabled: false
            EOT,
        ]
      + verify                     = false
      + version                    = "0.15.3"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.metallb_config will be created
  + resource "helm_release" "metallb_config" {
      + atomic                     = true
      + chart                      = "MetalLB-address-pool"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "metallb-config"
      + namespace                  = "metallb-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://georgelucker.github.io/fx-reg/"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = [
          + <<-EOT
                ipAddressPool:
                  name: default-pool
                  namespace: metallb-system
                  address: 192.168.0.240-192.168.0.249
                  autoAssign: true
                
                l2Advertisement:
                  name: l2-addr
                  namespace: metallb-system
                  ipAddressPool: default-pool
            EOT,
        ]
      + verify                     = false
      + version                    = "0.1.2"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.oauth2_proxy will be created
  + resource "helm_release" "oauth2_proxy" {
      + atomic                     = true
      + chart                      = "oauth2-proxy"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "oauth2-proxy"
      + namespace                  = "oauth2-proxy"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://oauth2-proxy.github.io/manifests"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = [
          + (sensitive value),
        ]
      + verify                     = false
      + version                    = "10.1.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.prometheus_operator_crds will be created
  + resource "helm_release" "prometheus_operator_crds" {
      + atomic                     = true
      + chart                      = "prometheus-operator-crds"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "prometheus-operator-crds"
      + namespace                  = "monitoring"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://prometheus-community.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = [
          + <<-EOT
                
            EOT,
        ]
      + verify                     = false
      + version                    = "26.0.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.snapshot_controller[0] will be created
  + resource "helm_release" "snapshot_controller" {
      + atomic                     = true
      + chart                      = "snapshot-controller"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "snapshot-controller"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://piraeus.io/helm-charts/"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = [
          + <<-EOT
                webhook:
                  resources:
                    requests:
                      cpu: 50m
                      memory: 30Mi
                    limits:
                      cpu: 150m
                      memory: 50Mi
                controller:
                  resources:
                    requests:
                      cpu: 50m
                      memory: 50Mi
                    limits:
                      cpu: 150m
                      memory: 100Mi
            EOT,
        ]
      + verify                     = false
      + version                    = "5.0.2"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.sun2000_grafana_dashboard[0] will be created
  + resource "helm_release" "sun2000_grafana_dashboard" {
      + atomic                     = true
      + chart                      = "resource"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "sun2000-grafana-dashboard"
      + namespace                  = "monitoring"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://dasmeta.github.io/helm/"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = [
          + <<-EOT
                resource:
                  apiVersion: v1
                  kind: ConfigMap
                  metadata:
                    name: sun2000-grafana-dashboard
                    namespace: monitoring
                    labels:
                      grafana_dashboard: "1"
                  data:
                    sun2000.json: |-
                      {
                        "annotations": { "list": [] },
                        "editable": true,
                        "fiscalYearStartMonth": 0,
                        "graphTooltip": 1,
                        "panels": [
                          {
                            "datasource": { "type": "prometheus", "uid": "${datasource}" },
                            "fieldConfig": {
                              "defaults": {
                                "color": { "mode": "thresholds" },
                                "thresholds": {
                                  "steps": [
                                    { "color": "red", "value": null },
                                    { "color": "orange", "value": 0.1 },
                                    { "color": "green", "value": 1 }
                                  ]
                                },
                                "unit": "kwatt",
                                "min": 0
                              }
                            },
                            "gridPos": { "h": 6, "w": 5, "x": 0, "y": 0 },
                            "id": 1,
                            "options": {
                              "colorMode": "background",
                              "graphMode": "area",
                              "justifyMode": "auto",
                              "reduceOptions": { "calcs": ["lastNotNull"] }
                            },
                            "title": "Current Power",
                            "type": "stat",
                            "targets": [
                              { "expr": "sum(sun2000_real_time_power_kw)", "legendFormat": "Power", "refId": "A" }
                            ]
                          },
                          {
                            "datasource": { "type": "prometheus", "uid": "${datasource}" },
                            "fieldConfig": {
                              "defaults": {
                                "color": { "mode": "thresholds" },
                                "thresholds": {
                                  "steps": [{ "color": "blue", "value": null }, { "color": "green", "value": 0 }]
                                },
                                "unit": "kwatth",
                                "min": 0
                              }
                            },
                            "gridPos": { "h": 6, "w": 5, "x": 5, "y": 0 },
                            "id": 2,
                            "options": {
                              "colorMode": "background",
                              "graphMode": "none",
                              "reduceOptions": { "calcs": ["lastNotNull"] }
                            },
                            "title": "Today",
                            "type": "stat",
                            "targets": [
                              { "expr": "sum(sun2000_daily_energy_kwh)", "legendFormat": "Daily", "refId": "A" }
                            ]
                          },
                          {
                            "datasource": { "type": "prometheus", "uid": "${datasource}" },
                            "fieldConfig": {
                              "defaults": {
                                "unit": "kwatth",
                                "color": { "mode": "thresholds" },
                                "thresholds": {
                                  "steps": [{ "color": "blue", "value": null }, { "color": "green", "value": 0 }]
                                }
                              }
                            },
                            "gridPos": { "h": 6, "w": 5, "x": 10, "y": 0 },
                            "id": 3,
                            "options": {
                              "colorMode": "background",
                              "graphMode": "none",
                              "reduceOptions": { "calcs": ["lastNotNull"] }
                            },
                            "title": "This Month",
                            "type": "stat",
                            "targets": [
                              { "expr": "sum(sun2000_month_energy_kwh)", "legendFormat": "Monthly", "refId": "A" }
                            ]
                          },
                          {
                            "datasource": { "type": "prometheus", "uid": "${datasource}" },
                            "fieldConfig": {
                              "defaults": {
                                "unit": "dateTimeAsIso",
                                "color": { "mode": "fixed", "fixedColor": "grey" }
                              }
                            },
                            "gridPos": { "h": 6, "w": 9, "x": 15, "y": 0 },
                            "id": 10,
                            "options": {
                              "colorMode": "value",
                              "graphMode": "none",
                              "justifyMode": "center",
                              "textMode": "value",
                              "reduceOptions": { "calcs": ["lastNotNull"] }
                            },
                            "title": "Last Kiosk Refresh",
                            "type": "stat",
                            "targets": [
                              { "expr": "sum(sun2000_last_scrape_timestamp) * 1000", "refId": "A" }
                            ]
                          },
                          {
                            "datasource": { "type": "prometheus", "uid": "${datasource}" },
                            "fieldConfig": {
                              "defaults": {
                                "custom": {
                                  "drawStyle": "line",
                                  "fillOpacity": 30,
                                  "lineInterpolation": "smooth"
                                },
                                "unit": "kwatt",
                                "min": 0
                              }
                            },
                            "gridPos": { "h": 10, "w": 24, "x": 0, "y": 6 },
                            "id": 5,
                            "title": "Power Output Over Time",
                            "type": "timeseries",
                            "targets": [
                              { "expr": "sum(sun2000_real_time_power_kw)", "legendFormat": "Power (kW)", "refId": "A" }
                            ]
                          }
                        ],
                        "schemaVersion": 39,
                        "templating": {
                          "list": [
                            {
                              "name": "datasource",
                              "query": "prometheus",
                              "refresh": 1,
                              "type": "datasource"
                            }
                          ]
                        },
                        "time": { "from": "now-24h", "to": "now" },
                        "title": "Sun2000 Solar Inverter",
                        "uid": "sun2000-solar",
                        "version": 2
                      }
            EOT,
        ]
      + verify                     = false
      + version                    = "0.1.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.sun2000_service_monitor[0] will be created
  + resource "helm_release" "sun2000_service_monitor" {
      + atomic                     = true
      + chart                      = "resource"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "sun2000-service-monitor"
      + namespace                  = "monitoring"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://dasmeta.github.io/helm/"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = [
          + <<-EOT
                resource:
                  apiVersion: monitoring.coreos.com/v1
                  kind: ServiceMonitor
                  metadata:
                    name: sun2000
                    namespace: monitoring
                  spec:
                    endpoints:
                    - interval: 60s
                      port: http
                      path: /metrics
                    namespaceSelector:
                      matchNames:
                      - monitoring
                    selector:
                      matchLabels:
                        app.kubernetes.io/instance: sun2000
                        app.kubernetes.io/name: sun2000
            EOT,
        ]
      + verify                     = false
      + version                    = "0.1.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.system_upgrade_controller will be created
  + resource "helm_release" "system_upgrade_controller" {
      + atomic                     = true
      + chart                      = "system-upgrade-controller"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "system-upgrade-controller"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://nimbolus.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = [
          + <<-EOT
                resources:
                  limits:
                    cpu: 150m
                    memory: 90Mi
                  requests:
                    cpu: 50m
                    memory: 30Mi
            EOT,
        ]
      + verify                     = false
      + version                    = "0.7.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.tempo[0] will be created
  + resource "helm_release" "tempo" {
      + atomic                     = true
      + chart                      = "tempo"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "tempo"
      + namespace                  = "monitoring"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://grafana.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = [
          + <<-EOT
                persistence:
                  enabled: true
                  size: 5Gi
                tempo:
                  metricsGenerator:
                    enabled: true
                    remoteWriteUrl: http://prometheus-operated:9090/api/v1/write
                  multitenancyEnabled: false
                  resources:
                    requests:
                      cpu: 100m
                      memory: 256Mi
                    limits:
                      cpu: 500m
                      memory: 1Gi
            EOT,
        ]
      + verify                     = false
      + version                    = "1.24.3"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.velero[0] will be created
  + resource "helm_release" "velero" {
      + atomic                     = true
      + chart                      = "velero"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "velero"
      + namespace                  = "velero"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://vmware-tanzu.github.io/helm-charts/"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = [
          + (sensitive value),
        ]
      + verify                     = false
      + version                    = "11.3.2"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.velero_backup_schedule[0] will be created
  + resource "helm_release" "velero_backup_schedule" {
      + atomic                     = true
      + chart                      = "resource"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "velero-backup-schedule"
      + namespace                  = "velero"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://dasmeta.github.io/helm/"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = [
          + <<-EOT
                resource:
                  apiVersion: velero.io/v1
                  kind: Schedule
                  metadata:
                    name: regular
                    namespace: velero
                  spec:
                    schedule: 0 2 * * *
                    template:
                      defaultVolumesToFsBackup: true
                      excludedNamespaces:
                      - monitoring
                      includedNamespaces:
                      - "*"
                      storageLocation: default
                      ttl: 72h0m0s
            EOT,
        ]
      + verify                     = false
      + version                    = "0.1.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # null_resource.k3s_installed will be created
  + resource "null_resource" "k3s_installed" {
      + id       = (known after apply)
      + triggers = {
          + "recreate_tag" = "v1"
        }
    }

  # random_string.bifrost_enc_key will be created
  + resource "random_string" "bifrost_enc_key" {
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # random_string.bifrost_pg_password will be created
  + resource "random_string" "bifrost_pg_password" {
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # random_string.oauth2_proxy_client_secret will be created
  + resource "random_string" "oauth2_proxy_client_secret" {
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # random_string.oauth2_proxy_cookie_secret will be created
  + resource "random_string" "oauth2_proxy_cookie_secret" {
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # ssh_sensitive_resource.destroy_k3s_all["k3s-master-1"] will be created
  + resource "ssh_sensitive_resource" "destroy_k3s_all" {
      + agent                              = false
      + bastion_port                       = "22"
      + commands                           = [
          + "(pkill -9 -f 'k3s|containerd|longhorn'|| true) && (sleep 10 || true) && (k3s-killall.sh || true) && (k3s-uninstall.sh || true) && (k3s-agent-uninstall.sh || true) && (rm -rf /etc/rancher /var/lib/rancher /root/install_k3s.sh /var/log/k3s* /var/lib/longhorn /var/lib/containerd || true)",
        ]
      + commands_after_file_changes        = true
      + host                               = "192.168.0.101"
      + id                                 = (known after apply)
      + ignore_no_supported_methods_remain = false
      + port                               = "22"
      + private_key                        = (sensitive value)
      + result                             = (sensitive value)
      + retry_delay                        = "10s"
      + timeout                            = "15m"
      + triggers                           = {
          + "script_version" = "v1"
        }
      + user                               = "root"
      + when                               = "destroy"
    }

  # ssh_sensitive_resource.install_k3s_first_master will be created
  + resource "ssh_sensitive_resource" "install_k3s_first_master" {
      + agent                              = false
      + bastion_port                       = "22"
      + commands                           = [
          + "sysctl -w fs.inotify.max_user_watches=524288",
          + "sysctl -w fs.inotify.max_user_instances=512",
          + "sysctl -w fs.inotify.max_queued_events=32768",
          + "apt-get update",
          + "apt-get install -y curl jq iptables open-iscsi gpg apt-transport-https nfs-common systemd-timesyncd",
          + "systemctl enable --now systemd-timesyncd",
          + "curl -fsSL https://packages.buildkite.com/helm-linux/helm-debian/gpgkey | gpg --dearmor | tee /usr/share/keyrings/helm.gpg > /dev/null",
          + "echo \"deb [signed-by=/usr/share/keyrings/helm.gpg] https://packages.buildkite.com/helm-linux/helm-debian/any/ any main\" | tee /etc/apt/sources.list.d/helm-stable-debian.list",
          + "apt-get update",
          + "apt-get install -y helm",
          + "echo '192.168.0.240 dex.pr.inferencebros.com' | tee -a /etc/hosts",
          + "if [ ! -f /usr/local/bin/k3s ]; then curl -sL https://github.com/k3s-io/k3s/raw/main/contrib/util/generate-custom-ca-certs.sh | bash -; fi",
          + "curl -sfL https://get.k3s.io | sh -",
          + "sleep 150",
          + "k3s kubectl create namespace cert-manager || true",
          + "k3s kubectl create secret generic root-ca --from-file=tls.crt=/var/lib/rancher/k3s/server/tls/root-ca.pem --from-file=tls.key=/var/lib/rancher/k3s/server/tls/root-ca.key -n cert-manager || true",
          + "helm repo add kube-vip https://kube-vip.github.io/helm-charts/ || true",
          + "helm repo update",
          + "helm upgrade --install kube-vip kube-vip/kube-vip --version 0.9.5 --namespace kube-system --wait --timeout 5m --values /root/kube-vip-values.yaml --kubeconfig /etc/rancher/k3s/k3s.yaml",
          + "sleep 60",
          + <<-EOT
                jq -n \
                  --arg token "$(cat /var/lib/rancher/k3s/server/token)" \
                  --arg kubeconfig "$(base64 /etc/rancher/k3s/k3s.yaml | tr -d '\n')" \
                  '{token: $token, kubeconfig_b64: $kubeconfig}'
            EOT,
        ]
      + commands_after_file_changes        = true
      + host                               = "192.168.1.159"
      + id                                 = (known after apply)
      + ignore_no_supported_methods_remain = false
      + port                               = "22"
      + pre_commands                       = [
          + "mkdir -p /etc/rancher/k3s",
          + "mkdir -p /var/lib/rancher/k3s/server/tls",
        ]
      + private_key                        = (sensitive value)
      + result                             = (sensitive value)
      + retry_delay                        = "10s"
      + timeout                            = "30m"
      + triggers                           = {
          + "script_version" = "v1"
        }
      + user                               = "root"
      + when                               = "create"

      + file {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + file {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + file {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + file {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + file {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.control.helm_release.generic will be created
  + resource "helm_release" "generic" {
      + atomic                     = true
      + chart                      = "application"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "control"
      + namespace                  = "control"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://stakater.github.io/stakater-charts"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = [
          + (sensitive value),
        ]
      + verify                     = false
      + version                    = "6.14.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.sun2000[0].helm_release.generic will be created
  + resource "helm_release" "generic" {
      + atomic                     = true
      + chart                      = "application"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "sun2000"
      + namespace                  = "monitoring"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://stakater.github.io/stakater-charts"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = [
          + (sensitive value),
        ]
      + verify                     = false
      + version                    = "6.14.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

Plan: 40 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + k3s_kubeconfig_for_users = (sensitive value)

```

</details>

*Pusher: @dependabot[bot], Action: `pull_request`*